{
  "blocks": [
    {
      "id": "1",
      "content": [
        {
          "type": "text",
          "data": "Projects of the past few years. Some of them are done inside product teams of huge tech companies, like Yandex. Some are helping local businesses to flourish, like Maestrello (delicious pizza, btw). Some are done as briefs from international companies, like Badoo."
        }
      ]
    },
    {
      "id": "2",
      "content": [
        { "type": "header", "data": "Maestrello" },
        {
          "type": "text",
          "data": "Together with Madebymad I helped a local pizza place to grow online deliveries of pizza. I joined the team at a stage, when we were to put concept into real user scenarios. We ended with full UI Kit for both web and mobile sites. And supported the client along the content creation & development. Here's a swift animation I prepared to showcase the project."
        },
        {
          "type": "video",
          "src": "/projects/other/maestrello-1.mp4"
        },
        {
          "type": "image",
          "src": "/projects/other/maestrello-2.png"
        }
      ]
    },
    {
      "id": "3",
      "content": [
        { "type": "header", "data": "One & Double" },
        {
          "type": "text",
          "data": "Another project with Madebymad. We launched an app for local coffee shops with fixed prices. I was responsible for the whole flow map, creating UI kit, tickling edge cases, and supporting iOS and Android developers."
        },
        {
          "type": "image",
          "src": "/projects/other/coffee-1.png"
        },
        {
          "type": "image",
          "src": "/projects/other/coffee-2.png",
          "caption": "All screens were approved by low-fidelity mockups first"
        }
      ]
    },
    {
      "id": "4",
      "content": [
        { "type": "header", "data": "Yandex.Telephony" },
        {
          "type": "text",
          "data": "Yandex is one of the biggest Russian tech companies. Telephony connects small and medium businesses with customers. And provides them with smart analytics, dashboards, and other utilities for calls. I was the only designer on a team and was responsible for all the things possible. Mobile app, web app, internal app for Yandex employees, landing pages, mails, and list goes on. Had much fun and learned a lot."
        },
        {
          "type": "image",
          "src": "/projects/other/yandex-1.png"
        },
        {
          "type": "image",
          "src": "/projects/other/yandex-2.png"
        }
      ]
    },
    {
      "id": "5",
      "content": [
        { "type": "header", "data": "Badoo voice dating" },
        {
          "type": "text",
          "data": "One of the final tasks at BHSAD course on product design is a brief from a real company. For my team, it was to rethink the way people meet each other on dating apps. We spent tremendous time in research and user interviews. After some time we ended up in voice dating concept. The project made it to U AWARDS short list."
        },
        {
          "type": "video",
          "src": "/projects/other/badoo-1.m4v"
        },
        {
          "type": "video",
          "src": "/projects/other/badoo-2.m4v"
        },
        {
          "type": "image",
          "src": "/projects/other/badoo-3.png"
        },
        {
          "type": "image",
          "src": "/projects/other/badoo-4.png",
          "caption": "We used JTBD approach a lot. This a doc we've done after interviews"
        }
      ]
    },
    {
      "id": "6",
      "content": [
        { "type": "header", "data": "Plant It" },
        {
          "type": "text",
          "data": "One of self-initiated projects on the same BHSAD course. Plant It allows you to grow yummy vegetables & greens at home. Full cycle of product design from research & market-fit and to final designs & presentation."
        },
        {
          "type": "image",
          "src": "/projects/other/plant-1.png"
        },
        {
          "type": "image",
          "src": "/projects/other/plant-2.png"
        }
      ]
    },
    {
      "id": "7",
      "content": [
        { "type": "header", "data": "Tachkum" },
        {
          "type": "text",
          "data": "Tachkum — is a cunning hero of Abkhazian fairy tales and my first ever font. Sans-serif with a high contrast is a perfect match for big texts in Russian, English, or Abkhazian languages. This is a result of 2 week workshop in type design."
        },
        {
          "type": "image",
          "src": "/projects/other/font-1.png",
          "fit": "fit"
        },
        {
          "type": "image",
          "src": "/projects/other/font-2.png",
          "fit": "fit"
        },
        {
          "type": "image",
          "src": "/projects/other/font-3.png",
          "fit": "fit"
        },
        {
          "type": "image",
          "src": "/projects/other/font-4.png",
          "fit": "fit"
        },
        {
          "type": "image",
          "src": "/projects/other/font-5.png",
          "fit": "fit"
        }
      ]
    }
  ]
}
